BO/apps/Pratiche/test_xml.xml

<?xml version='1.0' encoding='utf-8'?><soap:Envelope
    xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
    xmlns:xsd='http://www.w3.org/2001/XMLSchema'
    xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'>
    <soap:Body>
        <RicercaDocumentiString
            xmlns='http://tempuri.org/'>
            <RicercaFiltriStr><![CDATA[<RicercaFiltri><Protocollo><Anno>2017</Anno><Numero>1</Numero><Data></Data><RuoloInserimento></RuoloInserimento><DataAnnullamento></DataAnnullamento><RegistroEmergenzaUfficio></RegistroEmergenzaUfficio><RegistroEmergenzaNumero></RegistroEmergenzaNumero><RegistroEmergenzaData></RegistroEmergenzaData><AnnoCopia></AnnoCopia><NumeroCopia></NumeroCopia><UtenteInserimento></UtenteInserimento></Protocollo><Documento><Id></Id><Data></Data><Tipo></Tipo><Classifica></Classifica><MittenteInterno></MittenteInterno><Oggetto></Oggetto><TipoRicercaOggetto></TipoRicercaOggetto><Origine></Origine><Carico></Carico><AssegnazioneInterna></AssegnazioneInterna><DestinatarioInterno></DestinatarioInterno><Partecipati></Partecipati><UtenteInserimento></UtenteInserimento><RuoloInserimento></RuoloInserimento><DataInserimento></DataInserimento><DataEvidenza></DataEvidenza><DataScarto></DataScarto><DataSorteggio></DataSorteggio><DataInvio></DataInvio><Barcode></Barcode><Responsabile></Responsabile><RuoloResponsabile></RuoloResponsabile><MittenteDestinatario></MittenteDestinatario></Documento><Proposta><Organo></Organo><Trattamento></Trattamento><RegistroAnno></RegistroAnno><RegistroNumero></RegistroNumero><RegistroData></RegistroData><Relatore></Relatore><ImmediataEsecutivita></ImmediataEsecutivita><Capigruppo></Capigruppo><Prefetto></Prefetto><Coreco></Coreco></Proposta><Delibera><DeliberaAnno></DeliberaAnno><DeliberaNumero></DeliberaNumero><DeliberaData></DeliberaData><Organo></Organo><Trattamento></Trattamento><Relatore></Relatore><PubblicazioneData></PubblicazioneData><EsecutivitaData></EsecutivitaData><ImmediataEsecutivita></ImmediataEsecutivita><Capigruppo></Capigruppo><Prefetto></Prefetto><Coreco></Coreco></Delibera><Determina><DeterminaAnno></DeterminaAnno><DeterminaNumero></DeterminaNumero><DeterminaData></DeterminaData><Trattamento></Trattamento><Dirigente></Dirigente><PubblicazioneData></PubblicazioneData><EsecutivitaData></EsecutivitaData></Determina><Impegno><ImpegnoNumero></ImpegnoNumero><ImpegnoImporto></ImpegnoImporto><ImpegniTotale></ImpegniTotale></Impegno><Accertamento><AccertamentoNumero></AccertamentoNumero><AccertamentoImporto></AccertamentoImporto><ImpegniTotale></ImpegniTotale></Accertamento><Fascicolo><NonFascicolato></NonFascicolato><Anno></Anno><Numero></Numero><Id></Id><Oggetto></Oggetto><TipoRicercaOggetto></TipoRicercaOggetto><Classifica></Classifica><AltriDati></AltriDati><DataChiusura></DataChiusura><UtenteInserimento></UtenteInserimento><RuoloInserimento></RuoloInserimento><Responsabile></Responsabile><RuoloResponsabile></RuoloResponsabile></Fascicolo><Procedimento><CodiceFiscaleMittente></CodiceFiscaleMittente><StatoProcedimento></StatoProcedimento><IdIter></IdIter><StatoDocumento></StatoDocumento><InviatoDa></InviatoDa><DataInvio></DataInvio><Responsabile></Responsabile><Assegnazioni></Assegnazioni><CodicePasso></CodicePasso></Procedimento><DatiUtente><DatoUtente><NomeTabella></NomeTabella><NomeCampo></NomeCampo><ValoreCampo></ValoreCampo></DatoUtente><DatoUtente><NomeTabella></NomeTabella><NomeCampo></NomeCampo><ValoreCampo></ValoreCampo></DatoUtente><DatoUtente><NomeTabella></NomeTabella><NomeCampo></NomeCampo><ValoreCampo></ValoreCampo></DatoUtente></DatiUtente><PianoDiLavoro><IdPDL></IdPDL><MacroAttivita></MacroAttivita><Attivita></Attivita><StatoAttivita></StatoAttivita><Responsabile></Responsabile><DataScadenza></DataScadenza><DataInizioAttivita></DataInizioAttivita><DataFineAttivita></DataFineAttivita></PianoDiLavoro><Utente>IRIDEWEB</Utente><Ruolo>AMMINISTRATORE</Ruolo></RicercaFiltri>]]></RicercaFiltriStr>
            <CodiceAmministrazione></CodiceAmministrazione>
            <CodiceAOO></CodiceAOO>
        </RicercaDocumentiString>
    </soap:Body>
</soap:Envelope> 

<RicercaFiltri>
    <Protocollo>
        <Anno>2017</Anno>
        <Numero>1</Numero>
        <Data></Data>
        <RuoloInserimento></RuoloInserimento>
        <DataAnnullamento></DataAnnullamento>
        <RegistroEmergenzaUfficio></RegistroEmergenzaUfficio>
        <RegistroEmergenzaNumero></RegistroEmergenzaNumero>
        <RegistroEmergenzaData></RegistroEmergenzaData>
        <AnnoCopia></AnnoCopia>
        <NumeroCopia></NumeroCopia>
        <UtenteInserimento></UtenteInserimento>
    </Protocollo>
    <Documento>
        <Id></Id>
        <Data></Data>
        <Tipo></Tipo>
        <Classifica></Classifica>
        <MittenteInterno></MittenteInterno>
        <Oggetto></Oggetto>
        <TipoRicercaOggetto></TipoRicercaOggetto>
        <Origine></Origine>
        <Carico></Carico>
        <AssegnazioneInterna></AssegnazioneInterna>
        <DestinatarioInterno></DestinatarioInterno>
        <Partecipati></Partecipati>
        <UtenteInserimento></UtenteInserimento>
        <RuoloInserimento></RuoloInserimento>
        <DataInserimento></DataInserimento>
        <DataEvidenza></DataEvidenza>
        <DataScarto></DataScarto>
        <DataSorteggio></DataSorteggio>
        <DataInvio></DataInvio>
        <Barcode></Barcode>
        <Responsabile></Responsabile>
        <RuoloResponsabile></RuoloResponsabile>
        <MittenteDestinatario></MittenteDestinatario>
    </Documento>
    <Proposta>
        <Organo></Organo>
        <Trattamento></Trattamento>
        <RegistroAnno></RegistroAnno>
        <RegistroNumero></RegistroNumero>
        <RegistroData></RegistroData>
        <Relatore></Relatore>
        <ImmediataEsecutivita></ImmediataEsecutivita>
        <Capigruppo></Capigruppo>
        <Prefetto></Prefetto>
        <Coreco></Coreco>
    </Proposta>
    <Delibera>
        <DeliberaAnno></DeliberaAnno>
        <DeliberaNumero></DeliberaNumero>
        <DeliberaData></DeliberaData>
        <Organo></Organo>
        <Trattamento></Trattamento>
        <Relatore></Relatore>
        <PubblicazioneData></PubblicazioneData>
        <EsecutivitaData></EsecutivitaData>
        <ImmediataEsecutivita></ImmediataEsecutivita>
        <Capigruppo></Capigruppo>
        <Prefetto></Prefetto>
        <Coreco></Coreco>
    </Delibera>
    <Determina>
        <DeterminaAnno></DeterminaAnno>
        <DeterminaNumero></DeterminaNumero>
        <DeterminaData></DeterminaData>
        <Trattamento></Trattamento>
        <Dirigente></Dirigente>
        <PubblicazioneData></PubblicazioneData>
        <EsecutivitaData></EsecutivitaData>
    </Determina>
    <Impegno>
        <ImpegnoNumero></ImpegnoNumero>
        <ImpegnoImporto></ImpegnoImporto>
        <ImpegniTotale></ImpegniTotale>
    </Impegno>
    <Accertamento>
        <AccertamentoNumero></AccertamentoNumero>
        <AccertamentoImporto></AccertamentoImporto>
        <ImpegniTotale></ImpegniTotale>
    </Accertamento>
    <Fascicolo>
        <NonFascicolato></NonFascicolato>
        <Anno></Anno>
        <Numero></Numero>
        <Id></Id>
        <Oggetto></Oggetto>
        <TipoRicercaOggetto></TipoRicercaOggetto>
        <Classifica></Classifica>
        <AltriDati></AltriDati>
        <DataChiusura></DataChiusura>
        <UtenteInserimento></UtenteInserimento>
        <RuoloInserimento></RuoloInserimento>
        <Responsabile></Responsabile>
        <RuoloResponsabile></RuoloResponsabile>
    </Fascicolo>
    <Procedimento>
        <CodiceFiscaleMittente></CodiceFiscaleMittente>
        <StatoProcedimento></StatoProcedimento>
        <IdIter></IdIter>
        <StatoDocumento></StatoDocumento>
        <InviatoDa></InviatoDa>
        <DataInvio></DataInvio>
        <Responsabile></Responsabile>
        <Assegnazioni></Assegnazioni>
        <CodicePasso></CodicePasso>
    </Procedimento>
    <DatiUtente>
        <DatoUtente>
            <NomeTabella></NomeTabella>
            <NomeCampo></NomeCampo>
            <ValoreCampo></ValoreCampo>
        </DatoUtente>
        <DatoUtente>
            <NomeTabella></NomeTabella>
            <NomeCampo></NomeCampo>
            <ValoreCampo></ValoreCampo>
        </DatoUtente>
        <DatoUtente>
            <NomeTabella></NomeTabella>
            <NomeCampo></NomeCampo>
            <ValoreCampo></ValoreCampo>
        </DatoUtente>
    </DatiUtente>
    <PianoDiLavoro>
        <IdPDL></IdPDL>
        <MacroAttivita></MacroAttivita>
        <Attivita></Attivita>
        <StatoAttivita></StatoAttivita>
        <Responsabile></Responsabile>
        <DataScadenza></DataScadenza>
        <DataInizioAttivita></DataInizioAttivita>
        <DataFineAttivita></DataFineAttivita>
    </PianoDiLavoro>
    <Utente>IRIDEWEB</Utente>
    <Ruolo>AMMINISTRATORE</Ruolo>
</RicercaFiltri>